[
  {
    "number": 1,
    "text": "What is the biggest risk when you hold a large leveraged position on a crypto exchange?",
    "answers": [
      "Someone stealing your wallet private key",
      "Government taking your funds",
      "Getting liquidated if the price moves against you",
      "High network fees"
    ],
    "correct": 2
  },
  {
    "number": 2,
    "text": "In crypto trading, a \"whale\" usually means:",
    "answers": [
      "Someone or a group that owns a huge amount of a cryptocurrency",
      "A market maker on big exchanges",
      "A trader who only uses charts",
      "A developer who can change the project's code"
    ],
    "correct": 0
  },
  {
    "number": 3,
    "text": "What does \"slippage\" mean when trading crypto?",
    "answers": [
      "Price slowly dropping in a bear market",
      "The difference between the price you expected and the price you actually got",
      "Fees paid to liquidity providers",
      "Delay in confirming your order on the blockchain"
    ],
    "correct": 1
  },
  {
    "number": 4,
    "text": "Which on-chain metric is commonly used to check Bitcoin's network health and possible price direction?",
    "answers": [
      "How much Bitcoin flows in or out of exchanges",
      "Google search trends",
      "Daily mentions on Twitter",
      "Only the trading volume on centralized exchanges"
    ],
    "correct": 0
  },
  {
    "number": 5,
    "text": "When Bitcoin perpetual futures show a negative funding rate for many weeks in a row, plus very high open interest, it usually means:",
    "answers": [
      "The market sentiment is neutral with no clear direction",
      "It's just temporary distortion before the next contract rollover",
      "Longs are dominant and confident enough to pay shorts",
      "A short squeeze is about to happen because too many shorts are leveraged"
    ],
    "correct": 2
  },
  {
    "number": 6,
    "text": "What is a stop-loss order mainly used for in crypto trading?",
    "answers": [
      "Entering a trade only when price breaks a resistance level",
      "Buying more during price dips",
      "Automatically taking profits at a higher price",
      "Limiting your losses by closing the trade at a set price"
    ],
    "correct": 3
  },
  {
    "number": 7,
    "text": "Which strategy means buying crypto cheaper on one exchange and selling it higher on another at the same time?",
    "answers": [
      "Dollar-cost averaging",
      "Arbitrage",
      "Scalping",
      "HODLing"
    ],
    "correct": 1
  },
  {
    "number": 8,
    "text": "A positive funding rate in perpetual futures usually shows that:",
    "answers": [
      "The market is perfectly balanced",
      "A contract expiration is coming soon",
      "Shorts are paying longs",
      "Longs are paying shorts"
    ],
    "correct": 3
  },
  {
    "number": 9,
    "text": "On crypto lending platforms, some platforms lend out the same user-deposited coins multiple times to make extra profit. What is this risky practice called?",
    "answers": [
      "Proving reserves publicly on-chain",
      "Re-lending the same deposits over and over",
      "Withdrawing user funds",
      "Converting everything to stablecoins automatically"
    ],
    "correct": 1
  },
  {
    "number": 10,
    "text": "An experienced trader sees Bitcoin's Realized Price going up quickly while the spot price stays flat. This usually means:",
    "answers": [
      "Short-term holders are taking profits aggressively",
      "Only whales are quietly accumulating",
      "New buyers are coming in at higher prices, which could support the price later",
      "Long-term holders are selling at a loss"
    ],
    "correct": 2
  },
  {
    "number": 11,
    "text": "Why do traders use a limit order instead of a market order in crypto?",
    "answers": [
      "To buy or sell instantly at any price",
      "To automatically follow the price movement",
      "To choose the exact price they're happy to buy or sell at",
      "To hide how big their order is"
    ],
    "correct": 2
  },
  {
    "number": 12,
    "text": "In crypto, \"FOMO\" (Fear Of Missing Out) usually causes traders to:",
    "answers": [
      "Buy near local tops or all-time highs",
      "Slowly reduce their position size",
      "Move coins to cold storage",
      "Sell at market bottoms"
    ],
    "correct": 0
  },
  {
    "number": 13,
    "text": "What is a key risk of holding fiat-pegged stablecoins?",
    "answers": [
      "Only smart contract bugs",
      "The stablecoin losing its 1:1 peg to the fiat currency",
      "Mining difficulty changes",
      "A 51% attack on the blockchain"
    ],
    "correct": 1
  },
  {
    "number": 14,
    "text": "Long squeezes and short squeezes in crypto futures are mainly caused by:",
    "answers": [
      "Only regulatory news",
      "Sudden high transaction fees",
      "A chain of liquidations pushing price sharply in one direction",
      "Exchange downtime for maintenance"
    ],
    "correct": 2
  },
  {
    "number": 15,
    "text": "When you have a leveraged long position in a very volatile altcoin, what should you watch most closely in real time to avoid getting liquidated in a flash crash?",
    "answers": [
      "Total open interest on the exchange",
      "24-hour trading volume compared to market cap",
      "Just your unrealized profit/loss percentage",
      "Maintenance margin level and how close your margin ratio is to the liquidation price"
    ],
    "correct": 3
  }
]