[
  {
    "number": 1,
    "text": "What market condition is best confirmed by a rising price and rising Open Interest (OI)?",
    "answers": [
      "Fake breakout (lack of commitment)",
      "Long build-up (strong trend confirmation)",
      "Short covering (trend weakening)",
      "Long liquidation (panic selling)"
    ],
    "correct": 1
  },
  {
    "number": 2,
    "text": "In the context of Cumulative Volume Delta (CVD), what is absorption?",
    "answers": [
      "Price makes a lower low while CVD makes a higher low, indicating passive buying absorbing selling pressure",
      "Price makes a higher high and CVD also makes a higher high",
      "Volume Delta bars are all positive and exceed the average daily range",
      "Price moves sideways while CVD rises rapidly, signaling hidden accumulation"
    ],
    "correct": 0
  },
  {
    "number": 3,
    "text": "What does the TPO Value Area (TVA) represent?",
    "answers": [
      "The range where only single prints occurred",
      "The price range where price spent most of the session time (about 70%)",
      "The price range where the highest volume was traded",
      "The area between the session high and low"
    ],
    "correct": 1
  },
  {
    "number": 4,
    "text": "What is the TPO Point of Control (TPOC)?",
    "answers": [
      "The midpoint of the session range",
      "The price level with the highest traded volume",
      "The price level where the session closed",
      "The price level where the most time was spent during the session"
    ],
    "correct": 3
  },
  {
    "number": 5,
    "text": "A large sell limit order appears above price and disappears as price approaches it. What is this behavior called?",
    "answers": [
      "Quote stuffing",
      "Spoofing",
      "Iceberg order",
      "High Volume Node (HVN) creation"
    ],
    "correct": 1
  },
  {
    "number": 6,
    "text": "What is a Naked Point of Control (NPOC)?",
    "answers": [
      "A newly formed POC in the current session",
      "A prior session’s POC that price has not revisited",
      "A POC that already acted as support or resistance",
      "A POC formed only during low-volume sessions"
    ],
    "correct": 1
  },
  {
    "number": 7,
    "text": "What is the key difference between TPO-based levels and Volume Profile levels?",
    "answers": [
      "TPO focuses on time spent at price, not traded volume",
      "Volume Profile ignores market structure",
      "TPO uses volume while Volume Profile uses time",
      "TPO only works on higher timeframes"
    ],
    "correct": 0
  },
  {
    "number": 8,
    "text": "How can Buy & Sell Volume help confirm an imbalance continuation or fade?",
    "answers": [
      "By tracking how many indicators are on the chart",
      "By identifying dominant buying or selling pressure within the candle",
      "By measuring candle color only",
      "By comparing volume to the daily high"
    ],
    "correct": 1
  },
  {
    "number": 9,
    "text": "How does Buy & Sell Volume help distinguish absorption from a true breakout?",
    "answers": [
      "Absorption shows dominant volume without price continuation, while breakouts align volume with price movement",
      "Absorption shows low volume while breakouts show high volume",
      "Breakouts always occur at session highs or lows",
      "Absorption occurs only during low-volatility sessions"
    ],
    "correct": 0
  },
  {
    "number": 10,
    "text": "What is the benefit of using combined SPOT & PERP aggregation?",
    "answers": [
      "It highlights only retail trading activity",
      "It removes derivatives noise entirely",
      "It provides a more complete view of total market participation",
      "It prioritizes spot volume over futures volume"
    ],
    "correct": 2
  },
  {
    "number": 11,
    "text": "Which market structure best defines a bullish trend?",
    "answers": [
      "Equal highs and equal lows",
      "Lower highs and lower lows",
      "Higher highs and higher lows",
      "Lower highs and higher lows"
    ],
    "correct": 2
  },
  {
    "number": 12,
    "text": "A trader has a $10,000 account and risks 1% per trade. With a 50-point stop and $1 per point value, what is the correct contract?",
    "answers": [
      "10 contracts",
      "1 contract",
      "2 contracts",
      "5 contracts"
    ],
    "correct": 2
  },
  {
    "number": 13,
    "text": "Which RSI reading is most commonly considered overbought?",
    "answers": [
      "RSI above 30",
      "RSI above 70",
      "RSI below 20",
      "RSI between 40 and 50"
    ],
    "correct": 1
  },
  {
    "number": 14,
    "text": "What is a classic bullish signal in the MACD indicator?",
    "answers": [
      "MACD line crossing above the signal line",
      "Signal line flattening during consolidation",
      "Histogram turning negative below zero",
      "MACD crossing below signal above zero"
    ],
    "correct": 0
  },
  {
    "number": 15,
    "text": "Price is in an uptrend with higher highs and higher lows. Buy volume dominates at support, RSI holds above 50, and MACD crosses bullish  What does this indicate?",
    "answers": [
      "A range-bound mean reversion trade",
      "A bullish trend continuation with strong confluence",
      "A high-risk countertrend reversal",
      "A short setup due to exhaustion"
    ],
    "correct": 1
  }
]