[
  {
    "number": 1,
    "text": "Before the birth of Jesus, in which town did Mary live when the angel first visited her?",
    "answers": [
      "Nazareth",
      "Bethlehem",
      "Egypt",
      "Jerusalem"
    ],
    "correct": 0
  },
  {
    "number": 2,
    "text": "Why did Mary and Joseph have to travel from Nazareth to Bethlehem?",
    "answers": [
      "To find a place with a manger",
      "To visit the three wise men",
      "To be counted in a census ordered by Caesar Augustus",
      "Because King Herod ordered them to leave"
    ],
    "correct": 2
  },
  {
    "number": 3,
    "text": "Since there was no room for them in Bethlehem, where was baby Jesus laid after he was born?",
    "answers": [
      "In a golden cradle",
      "In a shepherd's tent",
      "In a small wooden boat",
      "In a manger"
    ],
    "correct": 3
  },
  {
    "number": 4,
    "text": "What three special gifts did the wise men from the Eastern lands bring to worship Jesus?",
    "answers": [
      "Gold, Frankincense, and Myrrh",
      "Gold, Diamonds, and Pearls",
      "Silver, Silk, and Spices",
      "Bread, Wine, and Oil"
    ],
    "correct": 0
  },
  {
    "number": 5,
    "text": "Why did an angel warn Joseph in a dream to take Mary and Jesus and flee to Egypt?",
    "answers": [
      "Because King Herod was looking to kill Jesus",
      "Because there was a great famine in Israel",
      "To find their new home in the town of Nazareth",
      "Because the wise men invited them to their home"
    ],
    "correct": 0
  },
  {
    "number": 6,
    "text": "Who won the Friday Kimbillionaire Gameshow with the highest total score?",
    "answers": [
      "JB4 with 184 points",
      "Kerviz with 100 points",
      "KukiMuhi with 210 points",
      "Kerviz with 287 points"
    ],
    "correct": 3
  },
  {
    "number": 7,
    "text": "During the Friday Kimbillionaire Gameshow, how many lifelines were used and for what type of question?",
    "answers": [
      "One lifeline was used for a Bitcoin price level question related to the $125k target",
      "No lifelines were used during the game",
      "Two lifelines were used for market structure questions",
      "One lifeline was used for a Christmas-themed question"
    ],
    "correct": 0
  },
  {
    "number": 8,
    "text": "Which specific cryptocurrency was Hu Jhu Xin trading in the latest episode?",
    "answers": [
      "Bitcoin (BTC)",
      "Dogecoin (DOGE)",
      "Solana (SOL)",
      "Ethereum (Ether)"
    ],
    "correct": 3
  },
  {
    "number": 9,
    "text": "What market direction did Hu Jhu Xin explicitly decide to take for his Ethereum trade?",
    "answers": [
      "He decided to hedge both ways",
      "He decided to go Short",
      "He decided to stay in cash",
      "He decided to go Long"
    ],
    "correct": 3
  },
  {
    "number": 10,
    "text": "After presenting their gifts to Jesus, why did the wise men return to their country by a different route instead?",
    "answers": [
      "They were invited to visit Egypt by an angel",
      "They were warned by God in a dream to avoid King Herod",
      "The star they were following suddenly vanished",
      "They discovered a faster trade route through the desert"
    ],
    "correct": 1
  },
  {
    "number": 11,
    "text": "Which principle best summarizes the risk management?",
    "answers": [
      "Always aim for the highest possible leverage",
      "Risk more when you feel confident in a trade",
      "Focus only on entries and ignore exits",
      "Plan risk first: define entry, stop, target, and position size before executing"
    ],
    "correct": 3
  },
  {
    "number": 12,
    "text": "What is the name of the group Hu Jhu Xin addresses his followers during the videos?",
    "answers": [
      "Nazareth Knights",
      "Kimbillionaires",
      "Panda Warriors",
      "Lion Hyenas"
    ],
    "correct": 2
  },
  {
    "number": 13,
    "text": "During the aggressive price action, how many units or contracts did Satto scream to fill in the latest video?",
    "answers": [
      "2,000",
      "1,000",
      "5,000",
      "500"
    ],
    "correct": 0
  },
  {
    "number": 14,
    "text": "After the trade turned against him, what did Satto believe he had received?",
    "answers": [
      "Bad luck",
      "A curse",
      "A warning",
      "A blessing"
    ],
    "correct": 1
  },
  {
    "number": 15,
    "text": "What was Hu Jhu Xin's final message to his viewers at the very end of the latest video?",
    "answers": [
      "The victory is ours",
      "Never short Ethereum",
      "Merry Christmas",
      "See you tomorrow"
    ],
    "correct": 0
  }
]